
import sys
input = sys.stdin.readline

n, m = map(int, input().split())

paper = [list(map(int, input().split())) for _ in range(n)]
tetrominoes = [
    # ㅡ자 (가로)
    [(0,0), (0,1), (0,2), (0,3)],
    # ㅣ자 (세로)
    [(0,0), (1,0), (2,0), (3,0)],

    # ㅁ자
    [(0,0), (0,1), (1,0), (1,1)],

    # L자 계열
    [(0,0), (1,0), (2,0), (2,1)],
    [(0,0), (0,1), (1,1), (2,1)],
    [(0,0), (0,1), (0,2), (1,0)],
    [(0,0), (1,0), (1,1), (1,2)],
    [(0,2), (1,0), (1,1), (1,2)],
    [(0,0), (0,1), (1,0), (2,0)],
    [(0,0), (0,1), (0,2), (1,2)],
    [(0,1), (1,1), (2,0), (2,1)],

    # Z자 계열
    [(0,0), (0,1), (1,1), (1,2)],
    [(0,1), (1,0), (1,1), (2,0)],
    [(0,1), (0,2), (1,0), (1,1)],
    [(0,0), (1,0), (1,1), (2,1)],

    # ㅜ자 (T자)
    [(0,0), (0,1), (0,2), (1,1)],
    [(0,1), (1,0), (1,1), (2,1)],
    [(0,1), (1,0), (1,1), (1,2)],
    [(0,0), (1,0), (1,1), (2,0)],
]
max_val = 0
for i in range(0, n):
    for j in range(0, m):
        for shape in tetrominoes :
            total = 0
            for dx, dy in shape:
                ni = i+dx
                nj = j+dy
                if 0 <= ni < n and 0 <= nj < m:
                    total += paper[ni][nj]
                else:
                    valid = False
                    break
            max_val =  max(max_val, total)
print(max_val)